newXMLDocument.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sdmx="http://stats.oecd.org/OECDStatWS/SDMX/">
    <soapenv:Header/>
    <soapenv:Body>
        <sdmx:GetDataStructureDefinition><!--Optional:-->
            <sdmx:QueryMessage>
                <message:QueryMessage xsi:schemaLocation="http://www.SDMX.org/resources/SDMXML/schemas/v2_0/queryhttp://www.sdmx.org/docs/2_0/SDMXQuery.xsd http://www.SDMX.org/resources/SDMXML/schemas/v2_0/message http://www.sdmx.org/docs/2_0/SDMXMessage.xsd" xmlns="http://www.SDMX.org/resources/SDMXML/schemas/v2_0/query" xmlns:message="http://www.SDMX.org/resources/SDMXML/schemas/v2_0/message" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <Header xmlns="http://www.SDMX.org/resources/SDMXML/schemas/v2_0/message">
                        <ID>none</ID>
                        <Test>false</Test>
                        <Prepared>2012-06-01T09:33:53</Prepared>
                        <Sender id="YourID">
                            <Name xml:lang="en">Your English Name</Name>
                        </Sender>
                        <Receiver id="ABS">
                            <Name xml:lang="en">Australian Bureau of Statistics</Name>
                            <Name xml:lang="fr">Australian Bureau of Statistics</Name>
                        </Receiver>
                    </Header>
                    <message:Query>
                        <KeyFamilyWhere>
                            <Or>
                                <KeyFamily>ABS_CENSUS2011_B02</KeyFamily>
                            </Or>
                        </KeyFamilyWhere>
                    </message:Query>
                </message:QueryMessage>
            </sdmx:QueryMessage>
        </sdmx:GetDataStructureDefinition>
    </soapenv:Body>
</soapenv:Envelope>